app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" WHERE "pages"."permalink" = 'home' LIMIT 1
---
  def show
    @page = Page.find_by_permalink!(params[:id])

SELECT "pages".* FROM "pages" WHERE "pages"."permalink" = 'lezingen' LIMIT 1
SELECT "categories".* FROM "categories" WHERE "categories"."name" = 'Lezingen' ORDER BY "categories"."id" ASC LIMIT 1
---
  def category
    @page = Page.find_by_permalink!(params[:id])
    name = params[:id].capitalize
    @category = Category.where(name: name).first