app/controllers/pages_controller.rb

  def category
    @category = Category.current_category(params[:id]).first
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT 1