app/controllers/transactions_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "pages".* FROM "pages" WHERE "pages"."permalink" = 'voorwaarden' LIMIT 1
---
  def new
    @product = Product.find(params[:product_id])
    @transaction = Transaction.new
    @transaction.build_user
		@conditions = Page.find_by_permalink!('voorwaarden')

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = 'axelgraff@gmail.com' LIMIT 1
INSERT INTO "transactions" ("accept_conditions", "created_at", "product_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["accept_conditions", true], ["created_at", Sat, 23 May 2015 10:12:37 CEST +02:00], ["product_id", 2], ["updated_at", Sat, 23 May 2015 10:12:37 CEST +02:00], ["user_id", 2]]
INSERT INTO "users" ("confirmed_at", "created_at", "email", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "pages".* FROM "pages" WHERE "pages"."permalink" = 'voorwaarden' LIMIT 1
---
  def create
    @transaction = Transaction.new(transaction_params)
		@product = Product.find(transaction_params[:product_id])
		email = transaction_params[:user_attributes][:email]
		@user = User.find_by_email(email) || @user = create_user(transaction_params[:user_attributes])
    @transaction.user = @user
    if @transaction.save
      TransactionMailer.transaction_confirmation(@transaction).deliver
      redirect_to root_path, notice: 'Wij hebben uw aanmelding ontvangen!'
    else
			@conditions = Page.find_by_permalink!('voorwaarden')