app/views/products/show.html.erb

<!-- 		<table>
	<% @product.events.each do |event| %>
---
SELECT "events".* FROM "events" WHERE "events"."product_id" = ?  [["product_id", 1]]